PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.5 *
       3;* Date/Time created: Tue Jul 13 16:13:52 2021                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.5 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_DMEM_0_1
      15
      16$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("pru_rpmsg_init")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("pru_rpmsg_init")
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$324)
      19        .dwattr $C$DW$1, DW_AT_declaration
      20        .dwattr $C$DW$1, DW_AT_external

PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   21

    1101;* FNAME: main                          FR SIZE:   2           *
    1102;*                                                             *
    1103;* FUNCTION ENVIRONMENT                                        *
    1104;*                                                             *
    1105;* FUNCTION PROPERTIES                                         *
    1106;*                            0 Auto,  2 SOE     *
    1107;***************************************************************
    1108
    1109 00000000                 ||main||:
    1110;* --------------------------------------------------------------------------*
    1111        .dwcfi  cfa_offset, 0
    1112;***    ; the preceding call never returns
    1113 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
    1114        .dwcfi  cfa_offset, 2
    1115 00000004 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
    1116        .dwcfi  save_reg_to_mem, 14, -2
    1117        .dwcfi  save_reg_to_mem, 15, -1
    1118        .dwpsn  file "main.c",line 64,column 3,is_stmt,isa 0
    1119;----------------------------------------------------------------------
    1120;  64 | ADCConfigure();                                                        
    1121;----------------------------------------------------------------------
    1122$C$DW$53        .dwtag  DW_TAG_TI_branch
    1123        .dwattr $C$DW$53, DW_AT_low_pc(0x00)
    1124        .dwattr $C$DW$53, DW_AT_name("ADCConfigure")
    1125        .dwattr $C$DW$53, DW_AT_TI_call
    1126 00000008 000000230000C3!         JAL       r3.w2, ||ADCConfigure|| ; [ALU_PRU] |64| ADCConfigure
    1127        .dwpsn  file "main.c",line 65,column 3,is_stmt,isa 0
    1128;----------------------------------------------------------------------
    1129;  65 | pru_function();                                                        
    1130;----------------------------------------------------------------------
    1131$C$DW$54        .dwtag  DW_TAG_TI_branch
    1132        .dwattr $C$DW$54, DW_AT_low_pc(0x00)
    1133        .dwattr $C$DW$54, DW_AT_name("pru_function")
    1134        .dwattr $C$DW$54, DW_AT_TI_call
    1135 0000000c 000000230000C3!         JAL       r3.w2, ||pru_function|| ; [ALU_PRU] |65| pru_function
    1136 00000010 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
    1137        .dwcfi  restore_reg, 14
    1138        .dwcfi  restore_reg, 15
    1139 00000014 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
    1140        .dwcfi  cfa_offset, 0
    1141$C$DW$55        .dwtag  DW_TAG_TI_branch
    1142        .dwattr $C$DW$55, DW_AT_low_pc(0x00)
    1143        .dwattr $C$DW$55, DW_AT_TI_return
    1144 00000018 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1145        .dwattr $C$DW$52, DW_AT_TI_end_file("main.c")
    1146        .dwattr $C$DW$52, DW_AT_TI_end_line(0x42)
    1147        .dwattr $C$DW$52, DW_AT_TI_end_column(0x01)
    1148        .dwendentry
    1149        .dwendtag $C$DW$52
    1150
    1151;******************************************************************************
    1152;* STRINGS                                                                    *
    1153;******************************************************************************
    1154 00000000                         .sect   ".rodata:.string"
    1155 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   22

         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1156 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 30",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000030 
         00000014 00000000000000 
    1157 00000015 00000000000077  ||$C$SL3||:     .string "writen",0
         00000016 00000000000072 
         00000017 00000000000069 
         00000018 00000000000074 
         00000019 00000000000065 
         0000001a 0000000000006E 
         0000001b 00000000000000 
    1158;*****************************************************************************
    1159;* UNDEFINED EXTERNAL REFERENCES                                             *
    1160;*****************************************************************************
    1161        .global ||pru_rpmsg_init||
    1162        .global ||pru_rpmsg_receive||
    1163        .global ||pru_rpmsg_send||
    1164        .global ||pru_rpmsg_channel||
    1165
    1166;******************************************************************************
    1167;* TYPE INFORMATION                                                           *
    1168;******************************************************************************
    1169
    1170$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1171        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1172$C$DW$56        .dwtag  DW_TAG_member
    1173        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1174        .dwattr $C$DW$56, DW_AT_name("REVID")
    1175        .dwattr $C$DW$56, DW_AT_TI_symbol_name("REVID")
    1176        .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1177        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1179        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1180        .dwattr $C$DW$56, DW_AT_decl_line(0x2d)
    1181        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1182        .dwendtag $C$DW$T$19
    1183
    1184        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1185        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   23

    1186        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1187$C$DW$T$110     .dwtag  DW_TAG_volatile_type
    1188        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$19)
    1189
    1190$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1191        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1192$C$DW$57        .dwtag  DW_TAG_member
    1193        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1194        .dwattr $C$DW$57, DW_AT_name("IDLE_MODE")
    1195        .dwattr $C$DW$57, DW_AT_TI_symbol_name("IDLE_MODE")
    1196        .dwattr $C$DW$57, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1197        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1199        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1200        .dwattr $C$DW$57, DW_AT_decl_line(0x37)
    1201        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1202$C$DW$58        .dwtag  DW_TAG_member
    1203        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1204        .dwattr $C$DW$58, DW_AT_name("STANDBY_MODE")
    1205        .dwattr $C$DW$58, DW_AT_TI_symbol_name("STANDBY_MODE")
    1206        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1207        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1209        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1210        .dwattr $C$DW$58, DW_AT_decl_line(0x38)
    1211        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1212$C$DW$59        .dwtag  DW_TAG_member
    1213        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1214        .dwattr $C$DW$59, DW_AT_name("STANDBY_INIT")
    1215        .dwattr $C$DW$59, DW_AT_TI_symbol_name("STANDBY_INIT")
    1216        .dwattr $C$DW$59, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1217        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1219        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1220        .dwattr $C$DW$59, DW_AT_decl_line(0x39)
    1221        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1222$C$DW$60        .dwtag  DW_TAG_member
    1223        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1224        .dwattr $C$DW$60, DW_AT_name("SUB_MWAIT")
    1225        .dwattr $C$DW$60, DW_AT_TI_symbol_name("SUB_MWAIT")
    1226        .dwattr $C$DW$60, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1227        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1229        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1230        .dwattr $C$DW$60, DW_AT_decl_line(0x3a)
    1231        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1232$C$DW$61        .dwtag  DW_TAG_member
    1233        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1234        .dwattr $C$DW$61, DW_AT_name("rsvd6")
    1235        .dwattr $C$DW$61, DW_AT_TI_symbol_name("rsvd6")
    1236        .dwattr $C$DW$61, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1237        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1239        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1240        .dwattr $C$DW$61, DW_AT_decl_line(0x3b)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   24

    1241        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1242        .dwendtag $C$DW$T$20
    1243
    1244        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1245        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1246        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1247$C$DW$T$112     .dwtag  DW_TAG_volatile_type
    1248        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$20)
    1249
    1250$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1251        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1252$C$DW$62        .dwtag  DW_TAG_member
    1253        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1254        .dwattr $C$DW$62, DW_AT_name("PRU0_GPI_MODE")
    1255        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1256        .dwattr $C$DW$62, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1257        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1259        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1260        .dwattr $C$DW$62, DW_AT_decl_line(0x45)
    1261        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1262$C$DW$63        .dwtag  DW_TAG_member
    1263        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1264        .dwattr $C$DW$63, DW_AT_name("PRU0_GPI_CLK_MODE")
    1265        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1266        .dwattr $C$DW$63, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1267        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1269        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1270        .dwattr $C$DW$63, DW_AT_decl_line(0x46)
    1271        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1272$C$DW$64        .dwtag  DW_TAG_member
    1273        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1274        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_DIV0")
    1275        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1276        .dwattr $C$DW$64, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1277        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1279        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1280        .dwattr $C$DW$64, DW_AT_decl_line(0x47)
    1281        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1282$C$DW$65        .dwtag  DW_TAG_member
    1283        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1284        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_DIV1")
    1285        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1286        .dwattr $C$DW$65, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1287        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1289        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1290        .dwattr $C$DW$65, DW_AT_decl_line(0x48)
    1291        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1292$C$DW$66        .dwtag  DW_TAG_member
    1293        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1294        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_SB")
    1295        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_SB")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   25

    1296        .dwattr $C$DW$66, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1297        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1299        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1300        .dwattr $C$DW$66, DW_AT_decl_line(0x49)
    1301        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1302$C$DW$67        .dwtag  DW_TAG_member
    1303        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1304        .dwattr $C$DW$67, DW_AT_name("PRU0_GPO_MODE")
    1305        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1306        .dwattr $C$DW$67, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1307        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1309        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1310        .dwattr $C$DW$67, DW_AT_decl_line(0x4a)
    1311        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1312$C$DW$68        .dwtag  DW_TAG_member
    1313        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1314        .dwattr $C$DW$68, DW_AT_name("PRU0_GPO_DIV0")
    1315        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1316        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1317        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1319        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1320        .dwattr $C$DW$68, DW_AT_decl_line(0x4b)
    1321        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1322$C$DW$69        .dwtag  DW_TAG_member
    1323        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1324        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_DIV1")
    1325        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1326        .dwattr $C$DW$69, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1327        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1329        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1330        .dwattr $C$DW$69, DW_AT_decl_line(0x4c)
    1331        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1332$C$DW$70        .dwtag  DW_TAG_member
    1333        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1334        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_SH_SEL")
    1335        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1336        .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1337        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1339        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1340        .dwattr $C$DW$70, DW_AT_decl_line(0x4d)
    1341        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1342$C$DW$71        .dwtag  DW_TAG_member
    1343        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1344        .dwattr $C$DW$71, DW_AT_name("rsvd26")
    1345        .dwattr $C$DW$71, DW_AT_TI_symbol_name("rsvd26")
    1346        .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1347        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1349        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1350        .dwattr $C$DW$71, DW_AT_decl_line(0x4e)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   26

    1351        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1352        .dwendtag $C$DW$T$21
    1353
    1354        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1355        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1356        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1357$C$DW$T$114     .dwtag  DW_TAG_volatile_type
    1358        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$21)
    1359
    1360$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1361        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1362$C$DW$72        .dwtag  DW_TAG_member
    1363        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1364        .dwattr $C$DW$72, DW_AT_name("PRU1_GPI_MODE")
    1365        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1366        .dwattr $C$DW$72, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1367        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1369        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1370        .dwattr $C$DW$72, DW_AT_decl_line(0x58)
    1371        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1372$C$DW$73        .dwtag  DW_TAG_member
    1373        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1374        .dwattr $C$DW$73, DW_AT_name("PRU1_GPI_CLK_MODE")
    1375        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1376        .dwattr $C$DW$73, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1377        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1379        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1380        .dwattr $C$DW$73, DW_AT_decl_line(0x59)
    1381        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1382$C$DW$74        .dwtag  DW_TAG_member
    1383        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1384        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_DIV0")
    1385        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1386        .dwattr $C$DW$74, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1387        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1389        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1390        .dwattr $C$DW$74, DW_AT_decl_line(0x5a)
    1391        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1392$C$DW$75        .dwtag  DW_TAG_member
    1393        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1394        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_DIV1")
    1395        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1396        .dwattr $C$DW$75, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1397        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1399        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1400        .dwattr $C$DW$75, DW_AT_decl_line(0x5b)
    1401        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1402$C$DW$76        .dwtag  DW_TAG_member
    1403        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1404        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_SB")
    1405        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_SB")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   27

    1406        .dwattr $C$DW$76, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1407        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1409        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1410        .dwattr $C$DW$76, DW_AT_decl_line(0x5c)
    1411        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1412$C$DW$77        .dwtag  DW_TAG_member
    1413        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1414        .dwattr $C$DW$77, DW_AT_name("PRU1_GPO_MODE")
    1415        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1416        .dwattr $C$DW$77, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1417        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1419        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1420        .dwattr $C$DW$77, DW_AT_decl_line(0x5d)
    1421        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1422$C$DW$78        .dwtag  DW_TAG_member
    1423        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1424        .dwattr $C$DW$78, DW_AT_name("PRU1_GPO_DIV0")
    1425        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1426        .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1427        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1429        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1430        .dwattr $C$DW$78, DW_AT_decl_line(0x5e)
    1431        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1432$C$DW$79        .dwtag  DW_TAG_member
    1433        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1434        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_DIV1")
    1435        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1436        .dwattr $C$DW$79, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1437        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1439        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1440        .dwattr $C$DW$79, DW_AT_decl_line(0x5f)
    1441        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1442$C$DW$80        .dwtag  DW_TAG_member
    1443        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1444        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_SH_SEL")
    1445        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1446        .dwattr $C$DW$80, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1447        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1449        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1450        .dwattr $C$DW$80, DW_AT_decl_line(0x60)
    1451        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1452$C$DW$81        .dwtag  DW_TAG_member
    1453        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1454        .dwattr $C$DW$81, DW_AT_name("rsvd26")
    1455        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd26")
    1456        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1457        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1459        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1460        .dwattr $C$DW$81, DW_AT_decl_line(0x61)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   28

    1461        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1462        .dwendtag $C$DW$T$22
    1463
    1464        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1465        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1466        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1467$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1468        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$22)
    1469
    1470$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1471        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1472$C$DW$82        .dwtag  DW_TAG_member
    1473        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1474        .dwattr $C$DW$82, DW_AT_name("PRU0_CLK_STOP_REQ")
    1475        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1476        .dwattr $C$DW$82, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1477        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1479        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1480        .dwattr $C$DW$82, DW_AT_decl_line(0x6b)
    1481        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1482$C$DW$83        .dwtag  DW_TAG_member
    1483        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1484        .dwattr $C$DW$83, DW_AT_name("PRU0_CLK_STOP_ACK")
    1485        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1486        .dwattr $C$DW$83, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1487        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1489        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1490        .dwattr $C$DW$83, DW_AT_decl_line(0x6c)
    1491        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1492$C$DW$84        .dwtag  DW_TAG_member
    1493        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1494        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_EN")
    1495        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1496        .dwattr $C$DW$84, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1497        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1499        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1500        .dwattr $C$DW$84, DW_AT_decl_line(0x6d)
    1501        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1502$C$DW$85        .dwtag  DW_TAG_member
    1503        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1504        .dwattr $C$DW$85, DW_AT_name("PRU1_CLK_STOP_REQ")
    1505        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1506        .dwattr $C$DW$85, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1507        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1508        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1509        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1510        .dwattr $C$DW$85, DW_AT_decl_line(0x6e)
    1511        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1512$C$DW$86        .dwtag  DW_TAG_member
    1513        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1514        .dwattr $C$DW$86, DW_AT_name("PRU1_CLK_STOP_ACK")
    1515        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   29

    1516        .dwattr $C$DW$86, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1517        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1519        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1520        .dwattr $C$DW$86, DW_AT_decl_line(0x6f)
    1521        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1522$C$DW$87        .dwtag  DW_TAG_member
    1523        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1524        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_EN")
    1525        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1526        .dwattr $C$DW$87, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1527        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1529        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1530        .dwattr $C$DW$87, DW_AT_decl_line(0x70)
    1531        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1532$C$DW$88        .dwtag  DW_TAG_member
    1533        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1534        .dwattr $C$DW$88, DW_AT_name("INTC_CLK_STOP_REQ")
    1535        .dwattr $C$DW$88, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1536        .dwattr $C$DW$88, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1537        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1539        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1540        .dwattr $C$DW$88, DW_AT_decl_line(0x71)
    1541        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1542$C$DW$89        .dwtag  DW_TAG_member
    1543        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1544        .dwattr $C$DW$89, DW_AT_name("INTC_CLK_STOP_ACK")
    1545        .dwattr $C$DW$89, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1546        .dwattr $C$DW$89, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1547        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1549        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1550        .dwattr $C$DW$89, DW_AT_decl_line(0x72)
    1551        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1552$C$DW$90        .dwtag  DW_TAG_member
    1553        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1554        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_EN")
    1555        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1556        .dwattr $C$DW$90, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1557        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1559        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1560        .dwattr $C$DW$90, DW_AT_decl_line(0x73)
    1561        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1562$C$DW$91        .dwtag  DW_TAG_member
    1563        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1564        .dwattr $C$DW$91, DW_AT_name("UART_CLK_STOP_REQ")
    1565        .dwattr $C$DW$91, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1566        .dwattr $C$DW$91, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1567        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1569        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1570        .dwattr $C$DW$91, DW_AT_decl_line(0x74)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   30

    1571        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1572$C$DW$92        .dwtag  DW_TAG_member
    1573        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1574        .dwattr $C$DW$92, DW_AT_name("UART_CLK_STOP_ACK")
    1575        .dwattr $C$DW$92, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1576        .dwattr $C$DW$92, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1577        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1579        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1580        .dwattr $C$DW$92, DW_AT_decl_line(0x75)
    1581        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1582$C$DW$93        .dwtag  DW_TAG_member
    1583        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1584        .dwattr $C$DW$93, DW_AT_name("UART_CLK_EN")
    1585        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_EN")
    1586        .dwattr $C$DW$93, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1587        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1589        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1590        .dwattr $C$DW$93, DW_AT_decl_line(0x76)
    1591        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1592$C$DW$94        .dwtag  DW_TAG_member
    1593        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1594        .dwattr $C$DW$94, DW_AT_name("ECAP_CLK_STOP_REQ")
    1595        .dwattr $C$DW$94, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1596        .dwattr $C$DW$94, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1597        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1599        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1600        .dwattr $C$DW$94, DW_AT_decl_line(0x77)
    1601        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1602$C$DW$95        .dwtag  DW_TAG_member
    1603        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1604        .dwattr $C$DW$95, DW_AT_name("ECAP_CLK_STOP_ACK")
    1605        .dwattr $C$DW$95, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1606        .dwattr $C$DW$95, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1607        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1609        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1610        .dwattr $C$DW$95, DW_AT_decl_line(0x78)
    1611        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1612$C$DW$96        .dwtag  DW_TAG_member
    1613        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1614        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_EN")
    1615        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1616        .dwattr $C$DW$96, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1617        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1619        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1620        .dwattr $C$DW$96, DW_AT_decl_line(0x79)
    1621        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1622$C$DW$97        .dwtag  DW_TAG_member
    1623        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1624        .dwattr $C$DW$97, DW_AT_name("IEP_CLK_STOP_REQ")
    1625        .dwattr $C$DW$97, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   31

    1626        .dwattr $C$DW$97, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1627        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1629        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1630        .dwattr $C$DW$97, DW_AT_decl_line(0x7a)
    1631        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1632$C$DW$98        .dwtag  DW_TAG_member
    1633        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1634        .dwattr $C$DW$98, DW_AT_name("IEP_CLK_STOP_ACK")
    1635        .dwattr $C$DW$98, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1636        .dwattr $C$DW$98, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1637        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1639        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1640        .dwattr $C$DW$98, DW_AT_decl_line(0x7b)
    1641        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1642$C$DW$99        .dwtag  DW_TAG_member
    1643        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1644        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_EN")
    1645        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1646        .dwattr $C$DW$99, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1647        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1649        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1650        .dwattr $C$DW$99, DW_AT_decl_line(0x7c)
    1651        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1652$C$DW$100       .dwtag  DW_TAG_member
    1653        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1654        .dwattr $C$DW$100, DW_AT_name("rsvd18")
    1655        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd18")
    1656        .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1657        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1659        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1660        .dwattr $C$DW$100, DW_AT_decl_line(0x7d)
    1661        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1662        .dwendtag $C$DW$T$23
    1663
    1664        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1665        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1666        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1667$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1668        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$23)
    1669
    1670$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1671        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1672$C$DW$101       .dwtag  DW_TAG_member
    1673        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1674        .dwattr $C$DW$101, DW_AT_name("PRU0_IMEM_PE_RAW")
    1675        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1676        .dwattr $C$DW$101, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1677        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1679        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1680        .dwattr $C$DW$101, DW_AT_decl_line(0x87)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   32

    1681        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1682$C$DW$102       .dwtag  DW_TAG_member
    1683        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1684        .dwattr $C$DW$102, DW_AT_name("PRU0_DMEM_PE_RAW")
    1685        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1686        .dwattr $C$DW$102, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1687        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1689        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1690        .dwattr $C$DW$102, DW_AT_decl_line(0x88)
    1691        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1692$C$DW$103       .dwtag  DW_TAG_member
    1693        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1694        .dwattr $C$DW$103, DW_AT_name("PRU1_IMEM_PE_RAW")
    1695        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1696        .dwattr $C$DW$103, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1697        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1699        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1700        .dwattr $C$DW$103, DW_AT_decl_line(0x89)
    1701        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1702$C$DW$104       .dwtag  DW_TAG_member
    1703        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1704        .dwattr $C$DW$104, DW_AT_name("PRU1_DMEM_PE_RAW")
    1705        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1706        .dwattr $C$DW$104, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1707        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1709        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1710        .dwattr $C$DW$104, DW_AT_decl_line(0x8a)
    1711        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1712$C$DW$105       .dwtag  DW_TAG_member
    1713        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1714        .dwattr $C$DW$105, DW_AT_name("RAM_PE_RAW")
    1715        .dwattr $C$DW$105, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1716        .dwattr $C$DW$105, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1717        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1719        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1720        .dwattr $C$DW$105, DW_AT_decl_line(0x8b)
    1721        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1722$C$DW$106       .dwtag  DW_TAG_member
    1723        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1724        .dwattr $C$DW$106, DW_AT_name("rsvd20")
    1725        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd20")
    1726        .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1727        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1729        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1730        .dwattr $C$DW$106, DW_AT_decl_line(0x8c)
    1731        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1732        .dwendtag $C$DW$T$24
    1733
    1734        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1735        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   33

    1736        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1737$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1738        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$24)
    1739
    1740$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1741        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1742$C$DW$107       .dwtag  DW_TAG_member
    1743        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1744        .dwattr $C$DW$107, DW_AT_name("PRU0_IMEM_PE")
    1745        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1746        .dwattr $C$DW$107, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1747        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1749        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1750        .dwattr $C$DW$107, DW_AT_decl_line(0x96)
    1751        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1752$C$DW$108       .dwtag  DW_TAG_member
    1753        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1754        .dwattr $C$DW$108, DW_AT_name("PRU0_DMEM_PE")
    1755        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1756        .dwattr $C$DW$108, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1757        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1759        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1760        .dwattr $C$DW$108, DW_AT_decl_line(0x97)
    1761        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1762$C$DW$109       .dwtag  DW_TAG_member
    1763        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1764        .dwattr $C$DW$109, DW_AT_name("PRU1_IMEM_PE")
    1765        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1766        .dwattr $C$DW$109, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1767        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1769        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1770        .dwattr $C$DW$109, DW_AT_decl_line(0x98)
    1771        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1772$C$DW$110       .dwtag  DW_TAG_member
    1773        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1774        .dwattr $C$DW$110, DW_AT_name("PRU1_DMEM_PE")
    1775        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1776        .dwattr $C$DW$110, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1777        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1779        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1780        .dwattr $C$DW$110, DW_AT_decl_line(0x99)
    1781        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1782$C$DW$111       .dwtag  DW_TAG_member
    1783        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1784        .dwattr $C$DW$111, DW_AT_name("RAM_PE")
    1785        .dwattr $C$DW$111, DW_AT_TI_symbol_name("RAM_PE")
    1786        .dwattr $C$DW$111, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1787        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1789        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1790        .dwattr $C$DW$111, DW_AT_decl_line(0x9a)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   34

    1791        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1792$C$DW$112       .dwtag  DW_TAG_member
    1793        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1794        .dwattr $C$DW$112, DW_AT_name("rsvd20")
    1795        .dwattr $C$DW$112, DW_AT_TI_symbol_name("rsvd20")
    1796        .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1797        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1799        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1800        .dwattr $C$DW$112, DW_AT_decl_line(0x9b)
    1801        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1802        .dwendtag $C$DW$T$25
    1803
    1804        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1805        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1806        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1807$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1808        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$25)
    1809
    1810$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1811        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1812$C$DW$113       .dwtag  DW_TAG_member
    1813        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1814        .dwattr $C$DW$113, DW_AT_name("PRU0_IMEM_PE_SET")
    1815        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1816        .dwattr $C$DW$113, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1817        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1819        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1820        .dwattr $C$DW$113, DW_AT_decl_line(0xa4)
    1821        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1822$C$DW$114       .dwtag  DW_TAG_member
    1823        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1824        .dwattr $C$DW$114, DW_AT_name("PRU0_DMEM_PE_SET")
    1825        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1826        .dwattr $C$DW$114, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1827        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1829        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1830        .dwattr $C$DW$114, DW_AT_decl_line(0xa5)
    1831        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1832$C$DW$115       .dwtag  DW_TAG_member
    1833        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1834        .dwattr $C$DW$115, DW_AT_name("PRU1_IMEM_PE_SET")
    1835        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1836        .dwattr $C$DW$115, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1837        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1838        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1839        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1840        .dwattr $C$DW$115, DW_AT_decl_line(0xa6)
    1841        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1842$C$DW$116       .dwtag  DW_TAG_member
    1843        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1844        .dwattr $C$DW$116, DW_AT_name("PRU1_DMEM_PE_SET")
    1845        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   35

    1846        .dwattr $C$DW$116, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1847        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1849        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1850        .dwattr $C$DW$116, DW_AT_decl_line(0xa7)
    1851        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1852$C$DW$117       .dwtag  DW_TAG_member
    1853        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1854        .dwattr $C$DW$117, DW_AT_name("RAM_PE_SET")
    1855        .dwattr $C$DW$117, DW_AT_TI_symbol_name("RAM_PE_SET")
    1856        .dwattr $C$DW$117, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1857        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1859        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1860        .dwattr $C$DW$117, DW_AT_decl_line(0xa8)
    1861        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1862$C$DW$118       .dwtag  DW_TAG_member
    1863        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1864        .dwattr $C$DW$118, DW_AT_name("rsvd20")
    1865        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd20")
    1866        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1867        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1869        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1870        .dwattr $C$DW$118, DW_AT_decl_line(0xa9)
    1871        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1872        .dwendtag $C$DW$T$26
    1873
    1874        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1875        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1876        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1877$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1878        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$26)
    1879
    1880$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1881        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1882$C$DW$119       .dwtag  DW_TAG_member
    1883        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1884        .dwattr $C$DW$119, DW_AT_name("PRU0_IMEM_PE_CLR")
    1885        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1886        .dwattr $C$DW$119, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1887        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1888        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1889        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1890        .dwattr $C$DW$119, DW_AT_decl_line(0xb3)
    1891        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1892$C$DW$120       .dwtag  DW_TAG_member
    1893        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1894        .dwattr $C$DW$120, DW_AT_name("PRU0_DMEM_PE_CLR")
    1895        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1896        .dwattr $C$DW$120, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1897        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1899        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1900        .dwattr $C$DW$120, DW_AT_decl_line(0xb4)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   36

    1901        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1902$C$DW$121       .dwtag  DW_TAG_member
    1903        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1904        .dwattr $C$DW$121, DW_AT_name("PRU1_IMEM_PE_CLR")
    1905        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1906        .dwattr $C$DW$121, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1907        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1909        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1910        .dwattr $C$DW$121, DW_AT_decl_line(0xb5)
    1911        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1912$C$DW$122       .dwtag  DW_TAG_member
    1913        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1914        .dwattr $C$DW$122, DW_AT_name("PRU1_DMEM_PE_CLR")
    1915        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1916        .dwattr $C$DW$122, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1917        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1918        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1919        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1920        .dwattr $C$DW$122, DW_AT_decl_line(0xb6)
    1921        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1922$C$DW$123       .dwtag  DW_TAG_member
    1923        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1924        .dwattr $C$DW$123, DW_AT_name("rsvd16")
    1925        .dwattr $C$DW$123, DW_AT_TI_symbol_name("rsvd16")
    1926        .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1927        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1929        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1930        .dwattr $C$DW$123, DW_AT_decl_line(0xb7)
    1931        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1932        .dwendtag $C$DW$T$27
    1933
    1934        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1935        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1936        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1937$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1938        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$27)
    1939
    1940$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1941        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1942$C$DW$124       .dwtag  DW_TAG_member
    1943        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1944        .dwattr $C$DW$124, DW_AT_name("PMAO_PRU0")
    1945        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PMAO_PRU0")
    1946        .dwattr $C$DW$124, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1947        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1949        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1950        .dwattr $C$DW$124, DW_AT_decl_line(0xc4)
    1951        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1952$C$DW$125       .dwtag  DW_TAG_member
    1953        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1954        .dwattr $C$DW$125, DW_AT_name("PMAO_PRU1")
    1955        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PMAO_PRU1")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   37

    1956        .dwattr $C$DW$125, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1957        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1959        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1960        .dwattr $C$DW$125, DW_AT_decl_line(0xc5)
    1961        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1962$C$DW$126       .dwtag  DW_TAG_member
    1963        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1964        .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1965        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd2")
    1966        .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1967        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1969        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1970        .dwattr $C$DW$126, DW_AT_decl_line(0xc6)
    1971        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1972        .dwendtag $C$DW$T$28
    1973
    1974        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1975        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1976        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1977$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1978        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$28)
    1979
    1980$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1981        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1982$C$DW$127       .dwtag  DW_TAG_member
    1983        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1984        .dwattr $C$DW$127, DW_AT_name("OCP_EN")
    1985        .dwattr $C$DW$127, DW_AT_TI_symbol_name("OCP_EN")
    1986        .dwattr $C$DW$127, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1987        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1989        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1990        .dwattr $C$DW$127, DW_AT_decl_line(0xd3)
    1991        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1992$C$DW$128       .dwtag  DW_TAG_member
    1993        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1994        .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1995        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd1")
    1996        .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1997        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1999        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2000        .dwattr $C$DW$128, DW_AT_decl_line(0xd4)
    2001        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2002        .dwendtag $C$DW$T$29
    2003
    2004        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2005        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2006        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2007$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    2008        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$29)
    2009
    2010$C$DW$T$30      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   38

    2011        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2012$C$DW$129       .dwtag  DW_TAG_member
    2013        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2014        .dwattr $C$DW$129, DW_AT_name("PRU1_PAD_HP_EN")
    2015        .dwattr $C$DW$129, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2016        .dwattr $C$DW$129, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2017        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2019        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2020        .dwattr $C$DW$129, DW_AT_decl_line(0xde)
    2021        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2022$C$DW$130       .dwtag  DW_TAG_member
    2023        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2024        .dwattr $C$DW$130, DW_AT_name("XFR_SHIFT_EN")
    2025        .dwattr $C$DW$130, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2026        .dwattr $C$DW$130, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2027        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2029        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2030        .dwattr $C$DW$130, DW_AT_decl_line(0xdf)
    2031        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2032$C$DW$131       .dwtag  DW_TAG_member
    2033        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2034        .dwattr $C$DW$131, DW_AT_name("rsvd2")
    2035        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd2")
    2036        .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    2037        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2039        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2040        .dwattr $C$DW$131, DW_AT_decl_line(0xe0)
    2041        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2042        .dwendtag $C$DW$T$30
    2043
    2044        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2045        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2046        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2047$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    2048        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$30)
    2049
    2050$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2051        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2052$C$DW$132       .dwtag  DW_TAG_member
    2053        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2054        .dwattr $C$DW$132, DW_AT_name("PIN_MUX_SEL")
    2055        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2056        .dwattr $C$DW$132, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    2057        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2059        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2060        .dwattr $C$DW$132, DW_AT_decl_line(0xec)
    2061        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2062$C$DW$133       .dwtag  DW_TAG_member
    2063        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2064        .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2065        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd2")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   39

    2066        .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    2067        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2069        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2070        .dwattr $C$DW$133, DW_AT_decl_line(0xed)
    2071        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2072        .dwendtag $C$DW$T$31
    2073
    2074        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2075        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2076        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2077$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    2078        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$31)
    2079
    2080$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2081        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2082$C$DW$134       .dwtag  DW_TAG_member
    2083        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$111)
    2084        .dwattr $C$DW$134, DW_AT_name("$P$T0")
    2085        .dwattr $C$DW$134, DW_AT_TI_symbol_name("$P$T0")
    2086        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2088        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2089        .dwattr $C$DW$134, DW_AT_decl_line(0x29)
    2090        .dwattr $C$DW$134, DW_AT_decl_column(0x02)
    2091$C$DW$135       .dwtag  DW_TAG_member
    2092        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$113)
    2093        .dwattr $C$DW$135, DW_AT_name("$P$T1")
    2094        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T1")
    2095        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2096        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2097        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2098        .dwattr $C$DW$135, DW_AT_decl_line(0x33)
    2099        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    2100$C$DW$136       .dwtag  DW_TAG_member
    2101        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$115)
    2102        .dwattr $C$DW$136, DW_AT_name("$P$T2")
    2103        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T2")
    2104        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2105        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2106        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2107        .dwattr $C$DW$136, DW_AT_decl_line(0x41)
    2108        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    2109$C$DW$137       .dwtag  DW_TAG_member
    2110        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$117)
    2111        .dwattr $C$DW$137, DW_AT_name("$P$T3")
    2112        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T3")
    2113        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2114        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2115        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2116        .dwattr $C$DW$137, DW_AT_decl_line(0x54)
    2117        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2118$C$DW$138       .dwtag  DW_TAG_member
    2119        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$119)
    2120        .dwattr $C$DW$138, DW_AT_name("$P$T4")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   40

    2121        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T4")
    2122        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2123        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2124        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2125        .dwattr $C$DW$138, DW_AT_decl_line(0x67)
    2126        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2127$C$DW$139       .dwtag  DW_TAG_member
    2128        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$121)
    2129        .dwattr $C$DW$139, DW_AT_name("$P$T5")
    2130        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T5")
    2131        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2132        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2133        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2134        .dwattr $C$DW$139, DW_AT_decl_line(0x83)
    2135        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2136$C$DW$140       .dwtag  DW_TAG_member
    2137        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$123)
    2138        .dwattr $C$DW$140, DW_AT_name("$P$T6")
    2139        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T6")
    2140        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2141        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2142        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2143        .dwattr $C$DW$140, DW_AT_decl_line(0x92)
    2144        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2145$C$DW$141       .dwtag  DW_TAG_member
    2146        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$125)
    2147        .dwattr $C$DW$141, DW_AT_name("$P$T7")
    2148        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T7")
    2149        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2150        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2151        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2152        .dwattr $C$DW$141, DW_AT_decl_line(0xa0)
    2153        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2154$C$DW$142       .dwtag  DW_TAG_member
    2155        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$127)
    2156        .dwattr $C$DW$142, DW_AT_name("$P$T8")
    2157        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T8")
    2158        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2159        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2160        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2161        .dwattr $C$DW$142, DW_AT_decl_line(0xaf)
    2162        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2163$C$DW$143       .dwtag  DW_TAG_member
    2164        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$32)
    2165        .dwattr $C$DW$143, DW_AT_name("rsvd24")
    2166        .dwattr $C$DW$143, DW_AT_TI_symbol_name("rsvd24")
    2167        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2168        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2169        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2170        .dwattr $C$DW$143, DW_AT_decl_line(0xbc)
    2171        .dwattr $C$DW$143, DW_AT_decl_column(0x0b)
    2172$C$DW$144       .dwtag  DW_TAG_member
    2173        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$129)
    2174        .dwattr $C$DW$144, DW_AT_name("$P$T9")
    2175        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T9")
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   41

    2176        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2177        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2178        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2179        .dwattr $C$DW$144, DW_AT_decl_line(0xc0)
    2180        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2181$C$DW$145       .dwtag  DW_TAG_member
    2182        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$33)
    2183        .dwattr $C$DW$145, DW_AT_name("rsvd2c")
    2184        .dwattr $C$DW$145, DW_AT_TI_symbol_name("rsvd2c")
    2185        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2186        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2187        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2188        .dwattr $C$DW$145, DW_AT_decl_line(0xcb)
    2189        .dwattr $C$DW$145, DW_AT_decl_column(0x0b)
    2190$C$DW$146       .dwtag  DW_TAG_member
    2191        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$131)
    2192        .dwattr $C$DW$146, DW_AT_name("$P$T10")
    2193        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T10")
    2194        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2195        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2196        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2197        .dwattr $C$DW$146, DW_AT_decl_line(0xcf)
    2198        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2199$C$DW$147       .dwtag  DW_TAG_member
    2200        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$133)
    2201        .dwattr $C$DW$147, DW_AT_name("$P$T11")
    2202        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T11")
    2203        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2204        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2205        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2206        .dwattr $C$DW$147, DW_AT_decl_line(0xda)
    2207        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2208$C$DW$148       .dwtag  DW_TAG_member
    2209        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$34)
    2210        .dwattr $C$DW$148, DW_AT_name("rsvd38")
    2211        .dwattr $C$DW$148, DW_AT_TI_symbol_name("rsvd38")
    2212        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2213        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2214        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2215        .dwattr $C$DW$148, DW_AT_decl_line(0xe5)
    2216        .dwattr $C$DW$148, DW_AT_decl_column(0x0b)
    2217$C$DW$149       .dwtag  DW_TAG_member
    2218        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$135)
    2219        .dwattr $C$DW$149, DW_AT_name("$P$T12")
    2220        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T12")
    2221        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2222        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2223        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2224        .dwattr $C$DW$149, DW_AT_decl_line(0xe8)
    2225        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2226        .dwendtag $C$DW$T$35
    2227
    2228        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2229        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2230        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   42

    2231$C$DW$T$292     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2232        .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$35)
    2233        .dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
    2234        .dwattr $C$DW$T$292, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2235        .dwattr $C$DW$T$292, DW_AT_decl_line(0xf0)
    2236        .dwattr $C$DW$T$292, DW_AT_decl_column(0x03)
    2237$C$DW$T$293     .dwtag  DW_TAG_volatile_type
    2238        .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
    2239
    2240$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2241        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2242$C$DW$150       .dwtag  DW_TAG_member
    2243        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$36)
    2244        .dwattr $C$DW$150, DW_AT_name("type")
    2245        .dwattr $C$DW$150, DW_AT_TI_symbol_name("type")
    2246        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2248        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    2249        .dwattr $C$DW$150, DW_AT_decl_line(0x177)
    2250        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    2251$C$DW$151       .dwtag  DW_TAG_member
    2252        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$36)
    2253        .dwattr $C$DW$151, DW_AT_name("ver")
    2254        .dwattr $C$DW$151, DW_AT_TI_symbol_name("ver")
    2255        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2256        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2257        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    2258        .dwattr $C$DW$151, DW_AT_decl_line(0x178)
    2259        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2260        .dwendtag $C$DW$T$37
    2261
    2262        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_type
    2263        .dwattr $C$DW$T$37, DW_AT_decl_line(0x176)
    2264        .dwattr $C$DW$T$37, DW_AT_decl_column(0x0a)
    2265
    2266$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2267        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2268$C$DW$152       .dwtag  DW_TAG_member
    2269        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2270        .dwattr $C$DW$152, DW_AT_name("REV_MINOR")
    2271        .dwattr $C$DW$152, DW_AT_TI_symbol_name("REV_MINOR")
    2272        .dwattr $C$DW$152, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2273        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2275        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2276        .dwattr $C$DW$152, DW_AT_decl_line(0x2d)
    2277        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2278$C$DW$153       .dwtag  DW_TAG_member
    2279        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2280        .dwattr $C$DW$153, DW_AT_name("REV_CUSTOM")
    2281        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_CUSTOM")
    2282        .dwattr $C$DW$153, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2283        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2285        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   43

    2286        .dwattr $C$DW$153, DW_AT_decl_line(0x2e)
    2287        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2288$C$DW$154       .dwtag  DW_TAG_member
    2289        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2290        .dwattr $C$DW$154, DW_AT_name("REV_MAJOR")
    2291        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_MAJOR")
    2292        .dwattr $C$DW$154, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2293        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2295        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2296        .dwattr $C$DW$154, DW_AT_decl_line(0x2f)
    2297        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2298$C$DW$155       .dwtag  DW_TAG_member
    2299        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2300        .dwattr $C$DW$155, DW_AT_name("REV_RTL")
    2301        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_RTL")
    2302        .dwattr $C$DW$155, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2303        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2306        .dwattr $C$DW$155, DW_AT_decl_line(0x30)
    2307        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2308$C$DW$156       .dwtag  DW_TAG_member
    2309        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2310        .dwattr $C$DW$156, DW_AT_name("REV_MODULE")
    2311        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_MODULE")
    2312        .dwattr $C$DW$156, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2313        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2315        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2316        .dwattr $C$DW$156, DW_AT_decl_line(0x31)
    2317        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2318$C$DW$157       .dwtag  DW_TAG_member
    2319        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2320        .dwattr $C$DW$157, DW_AT_name("rsvd28")
    2321        .dwattr $C$DW$157, DW_AT_TI_symbol_name("rsvd28")
    2322        .dwattr $C$DW$157, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2323        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2324        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2325        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2326        .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    2327        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2328$C$DW$158       .dwtag  DW_TAG_member
    2329        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2330        .dwattr $C$DW$158, DW_AT_name("REV_SCHEME")
    2331        .dwattr $C$DW$158, DW_AT_TI_symbol_name("REV_SCHEME")
    2332        .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2333        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2335        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2336        .dwattr $C$DW$158, DW_AT_decl_line(0x33)
    2337        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2338        .dwendtag $C$DW$T$38
    2339
    2340        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   44

    2341        .dwattr $C$DW$T$38, DW_AT_decl_line(0x2c)
    2342        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2343$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    2344        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$38)
    2345
    2346$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2347        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2348$C$DW$159       .dwtag  DW_TAG_member
    2349        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2350        .dwattr $C$DW$159, DW_AT_name("rsvd0")
    2351        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd0")
    2352        .dwattr $C$DW$159, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2353        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2355        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2356        .dwattr $C$DW$159, DW_AT_decl_line(0x3d)
    2357        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2358$C$DW$160       .dwtag  DW_TAG_member
    2359        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2360        .dwattr $C$DW$160, DW_AT_name("NEST_MODE")
    2361        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEST_MODE")
    2362        .dwattr $C$DW$160, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2363        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2365        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2366        .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2367        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2368$C$DW$161       .dwtag  DW_TAG_member
    2369        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2370        .dwattr $C$DW$161, DW_AT_name("rsvd4")
    2371        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd4")
    2372        .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2373        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2375        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2376        .dwattr $C$DW$161, DW_AT_decl_line(0x3f)
    2377        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2378        .dwendtag $C$DW$T$39
    2379
    2380        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2381        .dwattr $C$DW$T$39, DW_AT_decl_line(0x3c)
    2382        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2383$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    2384        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$39)
    2385
    2386$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2387        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2388$C$DW$162       .dwtag  DW_TAG_member
    2389        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2390        .dwattr $C$DW$162, DW_AT_name("EN_HINT_ANY")
    2391        .dwattr $C$DW$162, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2392        .dwattr $C$DW$162, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2393        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2395        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   45

    2396        .dwattr $C$DW$162, DW_AT_decl_line(0x4c)
    2397        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2398$C$DW$163       .dwtag  DW_TAG_member
    2399        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2400        .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2401        .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd1")
    2402        .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2403        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2405        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2406        .dwattr $C$DW$163, DW_AT_decl_line(0x4d)
    2407        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2408        .dwendtag $C$DW$T$40
    2409
    2410        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2411        .dwattr $C$DW$T$40, DW_AT_decl_line(0x4b)
    2412        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2413$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    2414        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$40)
    2415
    2416$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2417        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2418$C$DW$164       .dwtag  DW_TAG_member
    2419        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2420        .dwattr $C$DW$164, DW_AT_name("GLB_NEST_LEVEL")
    2421        .dwattr $C$DW$164, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2422        .dwattr $C$DW$164, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2423        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2424        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2425        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2426        .dwattr $C$DW$164, DW_AT_decl_line(0x5a)
    2427        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2428$C$DW$165       .dwtag  DW_TAG_member
    2429        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2430        .dwattr $C$DW$165, DW_AT_name("rsvd9")
    2431        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd9")
    2432        .dwattr $C$DW$165, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2433        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2435        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2436        .dwattr $C$DW$165, DW_AT_decl_line(0x5b)
    2437        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2438$C$DW$166       .dwtag  DW_TAG_member
    2439        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2440        .dwattr $C$DW$166, DW_AT_name("AUTO_OVERRIDE")
    2441        .dwattr $C$DW$166, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2442        .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2443        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2445        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2446        .dwattr $C$DW$166, DW_AT_decl_line(0x5c)
    2447        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2448        .dwendtag $C$DW$T$41
    2449
    2450        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.5 Tue Jul 13 16:13:52 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   46

    2451        .dwattr $C$DW$T$41, DW_AT_decl_line(0x59)
    2452        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2453$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    2454        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$41)
    2455
    2456$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2457        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2458$C$DW$167       .dwtag  DW_TAG_member
    2459        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2460        .dwattr $C$DW$167, DW_AT_name("STS_SET_IDX")
    2461        .dwattr $C$DW$167, DW_AT_TI_symbol_name("STS_SET_IDX")
    2462        .dwattr $C$DW$167, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2463        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2465        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2466        .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    2467        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2468$C$DW$168       .dwtag  DW_TAG_member
    2469        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2470        .dwattr $C$DW$168, DW_AT_name("rsvd10")
    2471        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd10")
    2472        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2473        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2474        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2475        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2476        .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    2477        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2478        .dwendtag $C$DW$T$42
    2479
    2480        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2481        .dwattr $C$DW$T$42, DW_AT_decl_line(0x65)
    2482        .dwattr $C$DW$T$42, DW_AT_decl_column(0x13)
    2483$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2484        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$42)
    2485
    2486$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2487        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2488$C$DW$169       .dwtag  DW_TAG_member
    2489        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2490        .dwattr $C$DW$169, DW_AT_name("STS_CLR_IDX")
