PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.5 *
       3;* Date/Time created: Fri Jul  9 21:56:27 2021                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.5 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_DMEM_0_1
      15        .global __PRU_CREG_PRU_DMEM_1_0
      16
      17$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("atoi")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("atoi")
      19        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)
      20        .dwattr $C$DW$1, DW_AT_declaration

     782        .dwattr $C$DW$54, DW_AT_TI_begin_file("main.c")
     783        .dwattr $C$DW$54, DW_AT_TI_begin_line(0x8f)
     784        .dwattr $C$DW$54, DW_AT_TI_begin_column(0x08)
     785        .dwattr $C$DW$54, DW_AT_decl_file("main.c")
     786        .dwattr $C$DW$54, DW_AT_decl_line(0x8f)
     787        .dwattr $C$DW$54, DW_AT_decl_column(0x08)
     788        .dwattr $C$DW$54, DW_AT_TI_max_frame_size(0x02)
     789        .dwpsn  file "main.c",line 143,column 19,is_stmt,address ||main||,isa 0
     790
     791        .dwfde $C$DW$CIE, ||main||
     792;----------------------------------------------------------------------
     793; 143 | void main(void) {                                                      
     794;----------------------------------------------------------------------
     795
     796;***************************************************************
     797;* FNAME: main                          FR SIZE:   2           *
     798;*                                                             *
     799;* FUNCTION ENVIRONMENT                                        *
     800;*                                                             *
     801;* FUNCTION PROPERTIES                                         *
     802;*                            0 Auto,  2 SOE     *
     803;***************************************************************
     804
     805 00000000                 ||main||:
     806;* --------------------------------------------------------------------------*
     807        .dwcfi  cfa_offset, 0
     808;***    ; the preceding call never returns
     809 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     810        .dwcfi  cfa_offset, 2
     811 00000004 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     812        .dwcfi  save_reg_to_mem, 14, -2
     813        .dwcfi  save_reg_to_mem, 15, -1
     814        .dwpsn  file "main.c",line 144,column 5,is_stmt,isa 0
     815;----------------------------------------------------------------------
     816; 144 | pru_function(1);                                                       
     817;----------------------------------------------------------------------
     818$C$DW$55        .dwtag  DW_TAG_TI_branch
     819        .dwattr $C$DW$55, DW_AT_low_pc(0x00)
     820        .dwattr $C$DW$55, DW_AT_name("pru_function")
     821        .dwattr $C$DW$55, DW_AT_TI_call
     822 00000008 000000230000C3!         JAL       r3.w2, ||pru_function|| ; [ALU_PRU] |144| pru_function
     823 0000000c 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     824        .dwcfi  restore_reg, 14
     825        .dwcfi  restore_reg, 15
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   16

     826 00000010 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     827        .dwcfi  cfa_offset, 0
     828$C$DW$56        .dwtag  DW_TAG_TI_branch
     829        .dwattr $C$DW$56, DW_AT_low_pc(0x00)
     830        .dwattr $C$DW$56, DW_AT_TI_return
     831 00000014 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     832        .dwattr $C$DW$54, DW_AT_TI_end_file("main.c")
     833        .dwattr $C$DW$54, DW_AT_TI_end_line(0x91)
     834        .dwattr $C$DW$54, DW_AT_TI_end_column(0x03)
     835        .dwendentry
     836        .dwendtag $C$DW$54
     837
     838;******************************************************************************
     839;* STRINGS                                                                    *
     840;******************************************************************************
     841 00000000                         .sect   ".rodata:.string"
     842 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
     843 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 30",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000030 
         00000014 00000000000000 
     844;*****************************************************************************
     845;* UNDEFINED EXTERNAL REFERENCES                                             *
     846;*****************************************************************************
     847        .global ||atoi||
     848        .global ||pru_rpmsg_init||
     849        .global ||pru_rpmsg_receive||
     850        .global ||pru_rpmsg_send||
     851        .global ||pru_rpmsg_channel||
     852
     853;******************************************************************************
     854;* TYPE INFORMATION                                                           *
     855;******************************************************************************
     856
     857$C$DW$T$19      .dwtag  DW_TAG_structure_type
     858        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     859$C$DW$57        .dwtag  DW_TAG_member
     860        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     861        .dwattr $C$DW$57, DW_AT_name("REVID")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   17

     862        .dwattr $C$DW$57, DW_AT_TI_symbol_name("REVID")
     863        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     864        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     866        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     867        .dwattr $C$DW$57, DW_AT_decl_line(0x2d)
     868        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     869        .dwendtag $C$DW$T$19
     870
     871        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     872        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     873        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     874$C$DW$T$110     .dwtag  DW_TAG_volatile_type
     875        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$19)
     876
     877$C$DW$T$20      .dwtag  DW_TAG_structure_type
     878        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     879$C$DW$58        .dwtag  DW_TAG_member
     880        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     881        .dwattr $C$DW$58, DW_AT_name("IDLE_MODE")
     882        .dwattr $C$DW$58, DW_AT_TI_symbol_name("IDLE_MODE")
     883        .dwattr $C$DW$58, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     884        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     886        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     887        .dwattr $C$DW$58, DW_AT_decl_line(0x37)
     888        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     889$C$DW$59        .dwtag  DW_TAG_member
     890        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     891        .dwattr $C$DW$59, DW_AT_name("STANDBY_MODE")
     892        .dwattr $C$DW$59, DW_AT_TI_symbol_name("STANDBY_MODE")
     893        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     894        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     896        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     897        .dwattr $C$DW$59, DW_AT_decl_line(0x38)
     898        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     899$C$DW$60        .dwtag  DW_TAG_member
     900        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     901        .dwattr $C$DW$60, DW_AT_name("STANDBY_INIT")
     902        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_INIT")
     903        .dwattr $C$DW$60, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     904        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     906        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     907        .dwattr $C$DW$60, DW_AT_decl_line(0x39)
     908        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     909$C$DW$61        .dwtag  DW_TAG_member
     910        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     911        .dwattr $C$DW$61, DW_AT_name("SUB_MWAIT")
     912        .dwattr $C$DW$61, DW_AT_TI_symbol_name("SUB_MWAIT")
     913        .dwattr $C$DW$61, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     914        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     916        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   18

     917        .dwattr $C$DW$61, DW_AT_decl_line(0x3a)
     918        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     919$C$DW$62        .dwtag  DW_TAG_member
     920        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     921        .dwattr $C$DW$62, DW_AT_name("rsvd6")
     922        .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd6")
     923        .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     924        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     926        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     927        .dwattr $C$DW$62, DW_AT_decl_line(0x3b)
     928        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     929        .dwendtag $C$DW$T$20
     930
     931        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     932        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     933        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     934$C$DW$T$112     .dwtag  DW_TAG_volatile_type
     935        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$20)
     936
     937$C$DW$T$21      .dwtag  DW_TAG_structure_type
     938        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     939$C$DW$63        .dwtag  DW_TAG_member
     940        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     941        .dwattr $C$DW$63, DW_AT_name("PRU0_GPI_MODE")
     942        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     943        .dwattr $C$DW$63, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     944        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     946        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     947        .dwattr $C$DW$63, DW_AT_decl_line(0x45)
     948        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     949$C$DW$64        .dwtag  DW_TAG_member
     950        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     951        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_CLK_MODE")
     952        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     953        .dwattr $C$DW$64, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     954        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     956        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     957        .dwattr $C$DW$64, DW_AT_decl_line(0x46)
     958        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     959$C$DW$65        .dwtag  DW_TAG_member
     960        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     961        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_DIV0")
     962        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     963        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     964        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     966        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     967        .dwattr $C$DW$65, DW_AT_decl_line(0x47)
     968        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     969$C$DW$66        .dwtag  DW_TAG_member
     970        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     971        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV1")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   19

     972        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     973        .dwattr $C$DW$66, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     974        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     976        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     977        .dwattr $C$DW$66, DW_AT_decl_line(0x48)
     978        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     979$C$DW$67        .dwtag  DW_TAG_member
     980        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     981        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_SB")
     982        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     983        .dwattr $C$DW$67, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     984        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     986        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     987        .dwattr $C$DW$67, DW_AT_decl_line(0x49)
     988        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     989$C$DW$68        .dwtag  DW_TAG_member
     990        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     991        .dwattr $C$DW$68, DW_AT_name("PRU0_GPO_MODE")
     992        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     993        .dwattr $C$DW$68, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     994        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     996        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     997        .dwattr $C$DW$68, DW_AT_decl_line(0x4a)
     998        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     999$C$DW$69        .dwtag  DW_TAG_member
    1000        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1001        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_DIV0")
    1002        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1003        .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1004        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1006        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1007        .dwattr $C$DW$69, DW_AT_decl_line(0x4b)
    1008        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1009$C$DW$70        .dwtag  DW_TAG_member
    1010        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1011        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV1")
    1012        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1013        .dwattr $C$DW$70, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1014        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1016        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1017        .dwattr $C$DW$70, DW_AT_decl_line(0x4c)
    1018        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1019$C$DW$71        .dwtag  DW_TAG_member
    1020        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1021        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_SH_SEL")
    1022        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1023        .dwattr $C$DW$71, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1024        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1026        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   20

    1027        .dwattr $C$DW$71, DW_AT_decl_line(0x4d)
    1028        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1029$C$DW$72        .dwtag  DW_TAG_member
    1030        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1031        .dwattr $C$DW$72, DW_AT_name("rsvd26")
    1032        .dwattr $C$DW$72, DW_AT_TI_symbol_name("rsvd26")
    1033        .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1034        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1036        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1037        .dwattr $C$DW$72, DW_AT_decl_line(0x4e)
    1038        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1039        .dwendtag $C$DW$T$21
    1040
    1041        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1042        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1043        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1044$C$DW$T$114     .dwtag  DW_TAG_volatile_type
    1045        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$21)
    1046
    1047$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1048        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1049$C$DW$73        .dwtag  DW_TAG_member
    1050        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1051        .dwattr $C$DW$73, DW_AT_name("PRU1_GPI_MODE")
    1052        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1053        .dwattr $C$DW$73, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1054        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1056        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1057        .dwattr $C$DW$73, DW_AT_decl_line(0x58)
    1058        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1059$C$DW$74        .dwtag  DW_TAG_member
    1060        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1061        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_CLK_MODE")
    1062        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1063        .dwattr $C$DW$74, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1064        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1066        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1067        .dwattr $C$DW$74, DW_AT_decl_line(0x59)
    1068        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1069$C$DW$75        .dwtag  DW_TAG_member
    1070        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1071        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_DIV0")
    1072        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1073        .dwattr $C$DW$75, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1074        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1076        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1077        .dwattr $C$DW$75, DW_AT_decl_line(0x5a)
    1078        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1079$C$DW$76        .dwtag  DW_TAG_member
    1080        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1081        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV1")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   21

    1082        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1083        .dwattr $C$DW$76, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1084        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1086        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1087        .dwattr $C$DW$76, DW_AT_decl_line(0x5b)
    1088        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1089$C$DW$77        .dwtag  DW_TAG_member
    1090        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1091        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_SB")
    1092        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1093        .dwattr $C$DW$77, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1094        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1096        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1097        .dwattr $C$DW$77, DW_AT_decl_line(0x5c)
    1098        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1099$C$DW$78        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1101        .dwattr $C$DW$78, DW_AT_name("PRU1_GPO_MODE")
    1102        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1103        .dwattr $C$DW$78, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1104        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1106        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1107        .dwattr $C$DW$78, DW_AT_decl_line(0x5d)
    1108        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1109$C$DW$79        .dwtag  DW_TAG_member
    1110        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1111        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_DIV0")
    1112        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1113        .dwattr $C$DW$79, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1114        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1116        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1117        .dwattr $C$DW$79, DW_AT_decl_line(0x5e)
    1118        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1119$C$DW$80        .dwtag  DW_TAG_member
    1120        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1121        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV1")
    1122        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1123        .dwattr $C$DW$80, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1124        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1126        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1127        .dwattr $C$DW$80, DW_AT_decl_line(0x5f)
    1128        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1129$C$DW$81        .dwtag  DW_TAG_member
    1130        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1131        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_SH_SEL")
    1132        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1133        .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1134        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1136        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   22

    1137        .dwattr $C$DW$81, DW_AT_decl_line(0x60)
    1138        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1139$C$DW$82        .dwtag  DW_TAG_member
    1140        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1141        .dwattr $C$DW$82, DW_AT_name("rsvd26")
    1142        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd26")
    1143        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1144        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1146        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1147        .dwattr $C$DW$82, DW_AT_decl_line(0x61)
    1148        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1149        .dwendtag $C$DW$T$22
    1150
    1151        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1152        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1153        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1154$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1155        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$22)
    1156
    1157$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1158        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1159$C$DW$83        .dwtag  DW_TAG_member
    1160        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1161        .dwattr $C$DW$83, DW_AT_name("PRU0_CLK_STOP_REQ")
    1162        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1163        .dwattr $C$DW$83, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1164        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1167        .dwattr $C$DW$83, DW_AT_decl_line(0x6b)
    1168        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1169$C$DW$84        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1171        .dwattr $C$DW$84, DW_AT_name("PRU0_CLK_STOP_ACK")
    1172        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1173        .dwattr $C$DW$84, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1174        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1176        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1177        .dwattr $C$DW$84, DW_AT_decl_line(0x6c)
    1178        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1179$C$DW$85        .dwtag  DW_TAG_member
    1180        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1181        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_EN")
    1182        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1183        .dwattr $C$DW$85, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1184        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1187        .dwattr $C$DW$85, DW_AT_decl_line(0x6d)
    1188        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1189$C$DW$86        .dwtag  DW_TAG_member
    1190        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1191        .dwattr $C$DW$86, DW_AT_name("PRU1_CLK_STOP_REQ")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   23

    1192        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1193        .dwattr $C$DW$86, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1194        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1196        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1197        .dwattr $C$DW$86, DW_AT_decl_line(0x6e)
    1198        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1199$C$DW$87        .dwtag  DW_TAG_member
    1200        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1201        .dwattr $C$DW$87, DW_AT_name("PRU1_CLK_STOP_ACK")
    1202        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1203        .dwattr $C$DW$87, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1204        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1206        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1207        .dwattr $C$DW$87, DW_AT_decl_line(0x6f)
    1208        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1209$C$DW$88        .dwtag  DW_TAG_member
    1210        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1211        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_EN")
    1212        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1213        .dwattr $C$DW$88, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1214        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1216        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1217        .dwattr $C$DW$88, DW_AT_decl_line(0x70)
    1218        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1219$C$DW$89        .dwtag  DW_TAG_member
    1220        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1221        .dwattr $C$DW$89, DW_AT_name("INTC_CLK_STOP_REQ")
    1222        .dwattr $C$DW$89, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1223        .dwattr $C$DW$89, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1224        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1226        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1227        .dwattr $C$DW$89, DW_AT_decl_line(0x71)
    1228        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1229$C$DW$90        .dwtag  DW_TAG_member
    1230        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1231        .dwattr $C$DW$90, DW_AT_name("INTC_CLK_STOP_ACK")
    1232        .dwattr $C$DW$90, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1233        .dwattr $C$DW$90, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1234        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1236        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1237        .dwattr $C$DW$90, DW_AT_decl_line(0x72)
    1238        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1239$C$DW$91        .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1241        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_EN")
    1242        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1243        .dwattr $C$DW$91, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1244        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   24

    1247        .dwattr $C$DW$91, DW_AT_decl_line(0x73)
    1248        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1249$C$DW$92        .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1251        .dwattr $C$DW$92, DW_AT_name("UART_CLK_STOP_REQ")
    1252        .dwattr $C$DW$92, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1253        .dwattr $C$DW$92, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1254        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1256        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1257        .dwattr $C$DW$92, DW_AT_decl_line(0x74)
    1258        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1259$C$DW$93        .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1261        .dwattr $C$DW$93, DW_AT_name("UART_CLK_STOP_ACK")
    1262        .dwattr $C$DW$93, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1263        .dwattr $C$DW$93, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1264        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1266        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1267        .dwattr $C$DW$93, DW_AT_decl_line(0x75)
    1268        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1269$C$DW$94        .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1271        .dwattr $C$DW$94, DW_AT_name("UART_CLK_EN")
    1272        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_EN")
    1273        .dwattr $C$DW$94, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1274        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1277        .dwattr $C$DW$94, DW_AT_decl_line(0x76)
    1278        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1279$C$DW$95        .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1281        .dwattr $C$DW$95, DW_AT_name("ECAP_CLK_STOP_REQ")
    1282        .dwattr $C$DW$95, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1283        .dwattr $C$DW$95, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1284        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1286        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1287        .dwattr $C$DW$95, DW_AT_decl_line(0x77)
    1288        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1289$C$DW$96        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$96, DW_AT_name("ECAP_CLK_STOP_ACK")
    1292        .dwattr $C$DW$96, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1293        .dwattr $C$DW$96, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1294        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1296        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1297        .dwattr $C$DW$96, DW_AT_decl_line(0x78)
    1298        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1299$C$DW$97        .dwtag  DW_TAG_member
    1300        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1301        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_EN")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   25

    1302        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1303        .dwattr $C$DW$97, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1304        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1306        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1307        .dwattr $C$DW$97, DW_AT_decl_line(0x79)
    1308        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1309$C$DW$98        .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1311        .dwattr $C$DW$98, DW_AT_name("IEP_CLK_STOP_REQ")
    1312        .dwattr $C$DW$98, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1313        .dwattr $C$DW$98, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1314        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1316        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1317        .dwattr $C$DW$98, DW_AT_decl_line(0x7a)
    1318        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1319$C$DW$99        .dwtag  DW_TAG_member
    1320        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1321        .dwattr $C$DW$99, DW_AT_name("IEP_CLK_STOP_ACK")
    1322        .dwattr $C$DW$99, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1323        .dwattr $C$DW$99, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1324        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1326        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1327        .dwattr $C$DW$99, DW_AT_decl_line(0x7b)
    1328        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1329$C$DW$100       .dwtag  DW_TAG_member
    1330        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1331        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_EN")
    1332        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1333        .dwattr $C$DW$100, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1334        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1336        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1337        .dwattr $C$DW$100, DW_AT_decl_line(0x7c)
    1338        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1339$C$DW$101       .dwtag  DW_TAG_member
    1340        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1341        .dwattr $C$DW$101, DW_AT_name("rsvd18")
    1342        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd18")
    1343        .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1344        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1346        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1347        .dwattr $C$DW$101, DW_AT_decl_line(0x7d)
    1348        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1349        .dwendtag $C$DW$T$23
    1350
    1351        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1352        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1353        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1354$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1355        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$23)
    1356
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   26

    1357$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1358        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1359$C$DW$102       .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1361        .dwattr $C$DW$102, DW_AT_name("PRU0_IMEM_PE_RAW")
    1362        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1363        .dwattr $C$DW$102, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1364        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1366        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1367        .dwattr $C$DW$102, DW_AT_decl_line(0x87)
    1368        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1369$C$DW$103       .dwtag  DW_TAG_member
    1370        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1371        .dwattr $C$DW$103, DW_AT_name("PRU0_DMEM_PE_RAW")
    1372        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1373        .dwattr $C$DW$103, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1374        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1376        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1377        .dwattr $C$DW$103, DW_AT_decl_line(0x88)
    1378        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1379$C$DW$104       .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1381        .dwattr $C$DW$104, DW_AT_name("PRU1_IMEM_PE_RAW")
    1382        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1383        .dwattr $C$DW$104, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1384        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1386        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1387        .dwattr $C$DW$104, DW_AT_decl_line(0x89)
    1388        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1389$C$DW$105       .dwtag  DW_TAG_member
    1390        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1391        .dwattr $C$DW$105, DW_AT_name("PRU1_DMEM_PE_RAW")
    1392        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1393        .dwattr $C$DW$105, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1394        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1396        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1397        .dwattr $C$DW$105, DW_AT_decl_line(0x8a)
    1398        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1399$C$DW$106       .dwtag  DW_TAG_member
    1400        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1401        .dwattr $C$DW$106, DW_AT_name("RAM_PE_RAW")
    1402        .dwattr $C$DW$106, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1403        .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1404        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1406        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1407        .dwattr $C$DW$106, DW_AT_decl_line(0x8b)
    1408        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1409$C$DW$107       .dwtag  DW_TAG_member
    1410        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1411        .dwattr $C$DW$107, DW_AT_name("rsvd20")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   27

    1412        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd20")
    1413        .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1414        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1416        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1417        .dwattr $C$DW$107, DW_AT_decl_line(0x8c)
    1418        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1419        .dwendtag $C$DW$T$24
    1420
    1421        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1422        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1423        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1424$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1425        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$24)
    1426
    1427$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1428        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1429$C$DW$108       .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1431        .dwattr $C$DW$108, DW_AT_name("PRU0_IMEM_PE")
    1432        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1433        .dwattr $C$DW$108, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1434        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1436        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1437        .dwattr $C$DW$108, DW_AT_decl_line(0x96)
    1438        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1439$C$DW$109       .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1441        .dwattr $C$DW$109, DW_AT_name("PRU0_DMEM_PE")
    1442        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1443        .dwattr $C$DW$109, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1444        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1446        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1447        .dwattr $C$DW$109, DW_AT_decl_line(0x97)
    1448        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1449$C$DW$110       .dwtag  DW_TAG_member
    1450        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1451        .dwattr $C$DW$110, DW_AT_name("PRU1_IMEM_PE")
    1452        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1453        .dwattr $C$DW$110, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1454        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1456        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1457        .dwattr $C$DW$110, DW_AT_decl_line(0x98)
    1458        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1459$C$DW$111       .dwtag  DW_TAG_member
    1460        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1461        .dwattr $C$DW$111, DW_AT_name("PRU1_DMEM_PE")
    1462        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1463        .dwattr $C$DW$111, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1464        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1466        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   28

    1467        .dwattr $C$DW$111, DW_AT_decl_line(0x99)
    1468        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1469$C$DW$112       .dwtag  DW_TAG_member
    1470        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1471        .dwattr $C$DW$112, DW_AT_name("RAM_PE")
    1472        .dwattr $C$DW$112, DW_AT_TI_symbol_name("RAM_PE")
    1473        .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1474        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1476        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1477        .dwattr $C$DW$112, DW_AT_decl_line(0x9a)
    1478        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1479$C$DW$113       .dwtag  DW_TAG_member
    1480        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1481        .dwattr $C$DW$113, DW_AT_name("rsvd20")
    1482        .dwattr $C$DW$113, DW_AT_TI_symbol_name("rsvd20")
    1483        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1484        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1486        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$113, DW_AT_decl_line(0x9b)
    1488        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1489        .dwendtag $C$DW$T$25
    1490
    1491        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1492        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1493        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1494$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1495        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$25)
    1496
    1497$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1498        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1499$C$DW$114       .dwtag  DW_TAG_member
    1500        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1501        .dwattr $C$DW$114, DW_AT_name("PRU0_IMEM_PE_SET")
    1502        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1503        .dwattr $C$DW$114, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1504        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1506        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1507        .dwattr $C$DW$114, DW_AT_decl_line(0xa4)
    1508        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1509$C$DW$115       .dwtag  DW_TAG_member
    1510        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1511        .dwattr $C$DW$115, DW_AT_name("PRU0_DMEM_PE_SET")
    1512        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1513        .dwattr $C$DW$115, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1514        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1515        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1516        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1517        .dwattr $C$DW$115, DW_AT_decl_line(0xa5)
    1518        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1519$C$DW$116       .dwtag  DW_TAG_member
    1520        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1521        .dwattr $C$DW$116, DW_AT_name("PRU1_IMEM_PE_SET")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   29

    1522        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1523        .dwattr $C$DW$116, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1524        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1526        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1527        .dwattr $C$DW$116, DW_AT_decl_line(0xa6)
    1528        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1529$C$DW$117       .dwtag  DW_TAG_member
    1530        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1531        .dwattr $C$DW$117, DW_AT_name("PRU1_DMEM_PE_SET")
    1532        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1533        .dwattr $C$DW$117, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1534        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1536        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1537        .dwattr $C$DW$117, DW_AT_decl_line(0xa7)
    1538        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1539$C$DW$118       .dwtag  DW_TAG_member
    1540        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1541        .dwattr $C$DW$118, DW_AT_name("RAM_PE_SET")
    1542        .dwattr $C$DW$118, DW_AT_TI_symbol_name("RAM_PE_SET")
    1543        .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1544        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1546        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1547        .dwattr $C$DW$118, DW_AT_decl_line(0xa8)
    1548        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1549$C$DW$119       .dwtag  DW_TAG_member
    1550        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1551        .dwattr $C$DW$119, DW_AT_name("rsvd20")
    1552        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd20")
    1553        .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1554        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1556        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1557        .dwattr $C$DW$119, DW_AT_decl_line(0xa9)
    1558        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1559        .dwendtag $C$DW$T$26
    1560
    1561        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1562        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1563        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1564$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1565        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$26)
    1566
    1567$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1568        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1569$C$DW$120       .dwtag  DW_TAG_member
    1570        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1571        .dwattr $C$DW$120, DW_AT_name("PRU0_IMEM_PE_CLR")
    1572        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1573        .dwattr $C$DW$120, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1574        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1576        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   30

    1577        .dwattr $C$DW$120, DW_AT_decl_line(0xb3)
    1578        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1579$C$DW$121       .dwtag  DW_TAG_member
    1580        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1581        .dwattr $C$DW$121, DW_AT_name("PRU0_DMEM_PE_CLR")
    1582        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1583        .dwattr $C$DW$121, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1584        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1586        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1587        .dwattr $C$DW$121, DW_AT_decl_line(0xb4)
    1588        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1589$C$DW$122       .dwtag  DW_TAG_member
    1590        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1591        .dwattr $C$DW$122, DW_AT_name("PRU1_IMEM_PE_CLR")
    1592        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1593        .dwattr $C$DW$122, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1594        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1596        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1597        .dwattr $C$DW$122, DW_AT_decl_line(0xb5)
    1598        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1599$C$DW$123       .dwtag  DW_TAG_member
    1600        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1601        .dwattr $C$DW$123, DW_AT_name("PRU1_DMEM_PE_CLR")
    1602        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1603        .dwattr $C$DW$123, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1604        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1606        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1607        .dwattr $C$DW$123, DW_AT_decl_line(0xb6)
    1608        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1609$C$DW$124       .dwtag  DW_TAG_member
    1610        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1611        .dwattr $C$DW$124, DW_AT_name("rsvd16")
    1612        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd16")
    1613        .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1614        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1616        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1617        .dwattr $C$DW$124, DW_AT_decl_line(0xb7)
    1618        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1619        .dwendtag $C$DW$T$27
    1620
    1621        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1622        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1623        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1624$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1625        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$27)
    1626
    1627$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1628        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1629$C$DW$125       .dwtag  DW_TAG_member
    1630        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1631        .dwattr $C$DW$125, DW_AT_name("PMAO_PRU0")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   31

    1632        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PMAO_PRU0")
    1633        .dwattr $C$DW$125, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1634        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1636        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1637        .dwattr $C$DW$125, DW_AT_decl_line(0xc4)
    1638        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1639$C$DW$126       .dwtag  DW_TAG_member
    1640        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1641        .dwattr $C$DW$126, DW_AT_name("PMAO_PRU1")
    1642        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_PRU1")
    1643        .dwattr $C$DW$126, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1644        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1646        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1647        .dwattr $C$DW$126, DW_AT_decl_line(0xc5)
    1648        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1649$C$DW$127       .dwtag  DW_TAG_member
    1650        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1651        .dwattr $C$DW$127, DW_AT_name("rsvd2")
    1652        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd2")
    1653        .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1654        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1656        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1657        .dwattr $C$DW$127, DW_AT_decl_line(0xc6)
    1658        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1659        .dwendtag $C$DW$T$28
    1660
    1661        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1662        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1663        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1664$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1665        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$28)
    1666
    1667$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1668        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1669$C$DW$128       .dwtag  DW_TAG_member
    1670        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1671        .dwattr $C$DW$128, DW_AT_name("OCP_EN")
    1672        .dwattr $C$DW$128, DW_AT_TI_symbol_name("OCP_EN")
    1673        .dwattr $C$DW$128, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1674        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1676        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1677        .dwattr $C$DW$128, DW_AT_decl_line(0xd3)
    1678        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1679$C$DW$129       .dwtag  DW_TAG_member
    1680        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1681        .dwattr $C$DW$129, DW_AT_name("rsvd1")
    1682        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd1")
    1683        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1684        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1686        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   32

    1687        .dwattr $C$DW$129, DW_AT_decl_line(0xd4)
    1688        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1689        .dwendtag $C$DW$T$29
    1690
    1691        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1692        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1693        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1694$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1695        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$29)
    1696
    1697$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1698        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1699$C$DW$130       .dwtag  DW_TAG_member
    1700        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1701        .dwattr $C$DW$130, DW_AT_name("PRU1_PAD_HP_EN")
    1702        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1703        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1704        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1706        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1707        .dwattr $C$DW$130, DW_AT_decl_line(0xde)
    1708        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1709$C$DW$131       .dwtag  DW_TAG_member
    1710        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1711        .dwattr $C$DW$131, DW_AT_name("XFR_SHIFT_EN")
    1712        .dwattr $C$DW$131, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1713        .dwattr $C$DW$131, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1714        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1716        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1717        .dwattr $C$DW$131, DW_AT_decl_line(0xdf)
    1718        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1719$C$DW$132       .dwtag  DW_TAG_member
    1720        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1721        .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1722        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd2")
    1723        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1724        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1726        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1727        .dwattr $C$DW$132, DW_AT_decl_line(0xe0)
    1728        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1729        .dwendtag $C$DW$T$30
    1730
    1731        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1732        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1733        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1734$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1735        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$30)
    1736
    1737$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1738        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1739$C$DW$133       .dwtag  DW_TAG_member
    1740        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1741        .dwattr $C$DW$133, DW_AT_name("PIN_MUX_SEL")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   33

    1742        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1743        .dwattr $C$DW$133, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1744        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1746        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1747        .dwattr $C$DW$133, DW_AT_decl_line(0xec)
    1748        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1749$C$DW$134       .dwtag  DW_TAG_member
    1750        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1751        .dwattr $C$DW$134, DW_AT_name("rsvd2")
    1752        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd2")
    1753        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1754        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1756        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1757        .dwattr $C$DW$134, DW_AT_decl_line(0xed)
    1758        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1759        .dwendtag $C$DW$T$31
    1760
    1761        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1762        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1763        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1764$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    1765        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$31)
    1766
    1767$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1768        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1769$C$DW$135       .dwtag  DW_TAG_member
    1770        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$111)
    1771        .dwattr $C$DW$135, DW_AT_name("$P$T0")
    1772        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T0")
    1773        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1775        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1776        .dwattr $C$DW$135, DW_AT_decl_line(0x29)
    1777        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    1778$C$DW$136       .dwtag  DW_TAG_member
    1779        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$113)
    1780        .dwattr $C$DW$136, DW_AT_name("$P$T1")
    1781        .dwattr $C$DW$136, DW_AT_TI_symbol_name("$P$T1")
    1782        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1783        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1784        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1785        .dwattr $C$DW$136, DW_AT_decl_line(0x33)
    1786        .dwattr $C$DW$136, DW_AT_decl_column(0x02)
    1787$C$DW$137       .dwtag  DW_TAG_member
    1788        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$115)
    1789        .dwattr $C$DW$137, DW_AT_name("$P$T2")
    1790        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T2")
    1791        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1792        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1793        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1794        .dwattr $C$DW$137, DW_AT_decl_line(0x41)
    1795        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    1796$C$DW$138       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   34

    1797        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$117)
    1798        .dwattr $C$DW$138, DW_AT_name("$P$T3")
    1799        .dwattr $C$DW$138, DW_AT_TI_symbol_name("$P$T3")
    1800        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1801        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1802        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1803        .dwattr $C$DW$138, DW_AT_decl_line(0x54)
    1804        .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    1805$C$DW$139       .dwtag  DW_TAG_member
    1806        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$119)
    1807        .dwattr $C$DW$139, DW_AT_name("$P$T4")
    1808        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T4")
    1809        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1810        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1811        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1812        .dwattr $C$DW$139, DW_AT_decl_line(0x67)
    1813        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    1814$C$DW$140       .dwtag  DW_TAG_member
    1815        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$121)
    1816        .dwattr $C$DW$140, DW_AT_name("$P$T5")
    1817        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T5")
    1818        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1819        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1820        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1821        .dwattr $C$DW$140, DW_AT_decl_line(0x83)
    1822        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1823$C$DW$141       .dwtag  DW_TAG_member
    1824        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$123)
    1825        .dwattr $C$DW$141, DW_AT_name("$P$T6")
    1826        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T6")
    1827        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1828        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1829        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1830        .dwattr $C$DW$141, DW_AT_decl_line(0x92)
    1831        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1832$C$DW$142       .dwtag  DW_TAG_member
    1833        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$125)
    1834        .dwattr $C$DW$142, DW_AT_name("$P$T7")
    1835        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T7")
    1836        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1837        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1838        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1839        .dwattr $C$DW$142, DW_AT_decl_line(0xa0)
    1840        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1841$C$DW$143       .dwtag  DW_TAG_member
    1842        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$127)
    1843        .dwattr $C$DW$143, DW_AT_name("$P$T8")
    1844        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T8")
    1845        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1846        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1847        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1848        .dwattr $C$DW$143, DW_AT_decl_line(0xaf)
    1849        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1850$C$DW$144       .dwtag  DW_TAG_member
    1851        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   35

    1852        .dwattr $C$DW$144, DW_AT_name("rsvd24")
    1853        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd24")
    1854        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1855        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1856        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1857        .dwattr $C$DW$144, DW_AT_decl_line(0xbc)
    1858        .dwattr $C$DW$144, DW_AT_decl_column(0x0b)
    1859$C$DW$145       .dwtag  DW_TAG_member
    1860        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$129)
    1861        .dwattr $C$DW$145, DW_AT_name("$P$T9")
    1862        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T9")
    1863        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1864        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1865        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1866        .dwattr $C$DW$145, DW_AT_decl_line(0xc0)
    1867        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    1868$C$DW$146       .dwtag  DW_TAG_member
    1869        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
    1870        .dwattr $C$DW$146, DW_AT_name("rsvd2c")
    1871        .dwattr $C$DW$146, DW_AT_TI_symbol_name("rsvd2c")
    1872        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1873        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1874        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1875        .dwattr $C$DW$146, DW_AT_decl_line(0xcb)
    1876        .dwattr $C$DW$146, DW_AT_decl_column(0x0b)
    1877$C$DW$147       .dwtag  DW_TAG_member
    1878        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$131)
    1879        .dwattr $C$DW$147, DW_AT_name("$P$T10")
    1880        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T10")
    1881        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1882        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1883        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1884        .dwattr $C$DW$147, DW_AT_decl_line(0xcf)
    1885        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    1886$C$DW$148       .dwtag  DW_TAG_member
    1887        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$133)
    1888        .dwattr $C$DW$148, DW_AT_name("$P$T11")
    1889        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T11")
    1890        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1891        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1892        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1893        .dwattr $C$DW$148, DW_AT_decl_line(0xda)
    1894        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    1895$C$DW$149       .dwtag  DW_TAG_member
    1896        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$34)
    1897        .dwattr $C$DW$149, DW_AT_name("rsvd38")
    1898        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd38")
    1899        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1900        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1901        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1902        .dwattr $C$DW$149, DW_AT_decl_line(0xe5)
    1903        .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    1904$C$DW$150       .dwtag  DW_TAG_member
    1905        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$135)
    1906        .dwattr $C$DW$150, DW_AT_name("$P$T12")
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   36

    1907        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T12")
    1908        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1909        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1910        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1911        .dwattr $C$DW$150, DW_AT_decl_line(0xe8)
    1912        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    1913        .dwendtag $C$DW$T$35
    1914
    1915        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1916        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1917        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1918$C$DW$T$292     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1919        .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$35)
    1920        .dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
    1921        .dwattr $C$DW$T$292, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    1922        .dwattr $C$DW$T$292, DW_AT_decl_line(0xf0)
    1923        .dwattr $C$DW$T$292, DW_AT_decl_column(0x03)
    1924$C$DW$T$293     .dwtag  DW_TAG_volatile_type
    1925        .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
    1926
    1927$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1928        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1929$C$DW$151       .dwtag  DW_TAG_member
    1930        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$36)
    1931        .dwattr $C$DW$151, DW_AT_name("type")
    1932        .dwattr $C$DW$151, DW_AT_TI_symbol_name("type")
    1933        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1935        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    1936        .dwattr $C$DW$151, DW_AT_decl_line(0x177)
    1937        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    1938$C$DW$152       .dwtag  DW_TAG_member
    1939        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$36)
    1940        .dwattr $C$DW$152, DW_AT_name("ver")
    1941        .dwattr $C$DW$152, DW_AT_TI_symbol_name("ver")
    1942        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1943        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1944        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    1945        .dwattr $C$DW$152, DW_AT_decl_line(0x178)
    1946        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    1947        .dwendtag $C$DW$T$37
    1948
    1949        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_type
    1950        .dwattr $C$DW$T$37, DW_AT_decl_line(0x176)
    1951        .dwattr $C$DW$T$37, DW_AT_decl_column(0x0a)
    1952
    1953$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1954        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1955$C$DW$153       .dwtag  DW_TAG_member
    1956        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    1957        .dwattr $C$DW$153, DW_AT_name("REV_MINOR")
    1958        .dwattr $C$DW$153, DW_AT_TI_symbol_name("REV_MINOR")
    1959        .dwattr $C$DW$153, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1960        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   37

    1962        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1963        .dwattr $C$DW$153, DW_AT_decl_line(0x2d)
    1964        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    1965$C$DW$154       .dwtag  DW_TAG_member
    1966        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    1967        .dwattr $C$DW$154, DW_AT_name("REV_CUSTOM")
    1968        .dwattr $C$DW$154, DW_AT_TI_symbol_name("REV_CUSTOM")
    1969        .dwattr $C$DW$154, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1970        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1972        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1973        .dwattr $C$DW$154, DW_AT_decl_line(0x2e)
    1974        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    1975$C$DW$155       .dwtag  DW_TAG_member
    1976        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    1977        .dwattr $C$DW$155, DW_AT_name("REV_MAJOR")
    1978        .dwattr $C$DW$155, DW_AT_TI_symbol_name("REV_MAJOR")
    1979        .dwattr $C$DW$155, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1980        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1982        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1983        .dwattr $C$DW$155, DW_AT_decl_line(0x2f)
    1984        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    1985$C$DW$156       .dwtag  DW_TAG_member
    1986        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    1987        .dwattr $C$DW$156, DW_AT_name("REV_RTL")
    1988        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_RTL")
    1989        .dwattr $C$DW$156, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1990        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1992        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1993        .dwattr $C$DW$156, DW_AT_decl_line(0x30)
    1994        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    1995$C$DW$157       .dwtag  DW_TAG_member
    1996        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    1997        .dwattr $C$DW$157, DW_AT_name("REV_MODULE")
    1998        .dwattr $C$DW$157, DW_AT_TI_symbol_name("REV_MODULE")
    1999        .dwattr $C$DW$157, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2000        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2002        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2003        .dwattr $C$DW$157, DW_AT_decl_line(0x31)
    2004        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2005$C$DW$158       .dwtag  DW_TAG_member
    2006        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2007        .dwattr $C$DW$158, DW_AT_name("rsvd28")
    2008        .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd28")
    2009        .dwattr $C$DW$158, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2010        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2011        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2012        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2013        .dwattr $C$DW$158, DW_AT_decl_line(0x32)
    2014        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2015$C$DW$159       .dwtag  DW_TAG_member
    2016        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   38

    2017        .dwattr $C$DW$159, DW_AT_name("REV_SCHEME")
    2018        .dwattr $C$DW$159, DW_AT_TI_symbol_name("REV_SCHEME")
    2019        .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2020        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2022        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2023        .dwattr $C$DW$159, DW_AT_decl_line(0x33)
    2024        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2025        .dwendtag $C$DW$T$38
    2026
    2027        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2028        .dwattr $C$DW$T$38, DW_AT_decl_line(0x2c)
    2029        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2030$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    2031        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$38)
    2032
    2033$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2034        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2035$C$DW$160       .dwtag  DW_TAG_member
    2036        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2037        .dwattr $C$DW$160, DW_AT_name("rsvd0")
    2038        .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd0")
    2039        .dwattr $C$DW$160, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2040        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2042        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2043        .dwattr $C$DW$160, DW_AT_decl_line(0x3d)
    2044        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2045$C$DW$161       .dwtag  DW_TAG_member
    2046        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2047        .dwattr $C$DW$161, DW_AT_name("NEST_MODE")
    2048        .dwattr $C$DW$161, DW_AT_TI_symbol_name("NEST_MODE")
    2049        .dwattr $C$DW$161, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2050        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2052        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2053        .dwattr $C$DW$161, DW_AT_decl_line(0x3e)
    2054        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2055$C$DW$162       .dwtag  DW_TAG_member
    2056        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2057        .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2058        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd4")
    2059        .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2060        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2062        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2063        .dwattr $C$DW$162, DW_AT_decl_line(0x3f)
    2064        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2065        .dwendtag $C$DW$T$39
    2066
    2067        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2068        .dwattr $C$DW$T$39, DW_AT_decl_line(0x3c)
    2069        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2070$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    2071        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$39)
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   39

    2072
    2073$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2074        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2075$C$DW$163       .dwtag  DW_TAG_member
    2076        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2077        .dwattr $C$DW$163, DW_AT_name("EN_HINT_ANY")
    2078        .dwattr $C$DW$163, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2079        .dwattr $C$DW$163, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2080        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2083        .dwattr $C$DW$163, DW_AT_decl_line(0x4c)
    2084        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2085$C$DW$164       .dwtag  DW_TAG_member
    2086        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2087        .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2088        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd1")
    2089        .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2090        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2092        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2093        .dwattr $C$DW$164, DW_AT_decl_line(0x4d)
    2094        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2095        .dwendtag $C$DW$T$40
    2096
    2097        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2098        .dwattr $C$DW$T$40, DW_AT_decl_line(0x4b)
    2099        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2100$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    2101        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$40)
    2102
    2103$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2104        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2105$C$DW$165       .dwtag  DW_TAG_member
    2106        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2107        .dwattr $C$DW$165, DW_AT_name("GLB_NEST_LEVEL")
    2108        .dwattr $C$DW$165, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2109        .dwattr $C$DW$165, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2110        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2112        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2113        .dwattr $C$DW$165, DW_AT_decl_line(0x5a)
    2114        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2115$C$DW$166       .dwtag  DW_TAG_member
    2116        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2117        .dwattr $C$DW$166, DW_AT_name("rsvd9")
    2118        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd9")
    2119        .dwattr $C$DW$166, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2120        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2122        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2123        .dwattr $C$DW$166, DW_AT_decl_line(0x5b)
    2124        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2125$C$DW$167       .dwtag  DW_TAG_member
    2126        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Fri Jul  9 21:56:27 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBB-PRU-SHARED-MEM-ADC/pru_codes/tmp/main.asm           PAGE   40

    2127        .dwattr $C$DW$167, DW_AT_name("AUTO_OVERRIDE")
    2128        .dwattr $C$DW$167, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2129        .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2130        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2132        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2133        .dwattr $C$DW$167, DW_AT_decl_line(0x5c)
    2134        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2135        .dwendtag $C$DW$T$41
    2136
    2137        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2138        .dwattr $C$DW$T$41, DW_AT_decl_line(0x59)
    2139        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2140$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    2141        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$41)
    2142
    2143$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2144        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2145$C$DW$168       .dwtag  DW_TAG_member
    2146        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2147        .dwattr $C$DW$168, DW_AT_name("STS_SET_IDX")
    2148        .dwattr $C$DW$168, DW_AT_TI_symbol_name("STS_SET_IDX")
    2149        .dwattr $C$DW$168, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2150        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2152        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2153        .dwattr $C$DW$168, DW_AT_decl_line(0x66)
    2154        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2155$C$DW$169       .dwtag  DW_TAG_member
    2156        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2157        .dwattr $C$DW$169, DW_AT_name("rsvd10")
    2158        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd10")
    2159        .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2160        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2162        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2163        .dwattr $C$DW$169, DW_AT_decl_line(0x67)
    2164        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2165        .dwendtag $C$DW$T$42
    2166
    2167        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2168        .dwattr $C$DW$T$42, DW_AT_decl_line(0x65)
    2169        .dwattr $C$DW$T$42, DW_AT_decl_column(0x13)
    2170$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    2171        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$42)
    2172
    2173$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2174        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2175$C$DW$170       .dwtag  DW_TAG_member
    2176        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2177        .dwattr $C$DW$170, DW_AT_name("STS_CLR_IDX")
    2178        .dwattr $C$DW$170, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2179        .dwattr $C$DW$170, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
